__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Pair_Input (InputLayer)         [(None, 44)]         0                                            
__________________________________________________________________________________________________
Dense_1 (Dense)                 (None, 256)          11520       Pair_Input[0][0]                 
__________________________________________________________________________________________________
Batch_Normalization_1 (BatchNor (None, 256)          1024        Dense_1[0][0]                    
__________________________________________________________________________________________________
Activation_ReLU_1 (Activation)  (None, 256)          0           Batch_Normalization_1[0][0]      
__________________________________________________________________________________________________
Dense_2 (Dense)                 (None, 256)          65792       Activation_ReLU_1[0][0]          
__________________________________________________________________________________________________
Batch_Normalization_2 (BatchNor (None, 256)          1024        Dense_2[0][0]                    
__________________________________________________________________________________________________
Activation_ReLU_3 (Activation)  (None, 256)          0           Batch_Normalization_2[0][0]      
__________________________________________________________________________________________________
Dense_3 (Dense)                 (None, 256)          65792       Activation_ReLU_3[0][0]          
__________________________________________________________________________________________________
Batch_Normalization_3 (BatchNor (None, 256)          1024        Dense_3[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 7)            1799        Batch_Normalization_3[0][0]      
__________________________________________________________________________________________________
Vertex_Output (Activation)      (None, 7)            0           dense[0][0]                      
__________________________________________________________________________________________________
Position_Output (Dense)         (None, 1)            257         Batch_Normalization_3[0][0]      
==================================================================================================
Total params: 148,232
Trainable params: 146,696
Non-trainable params: 1,536
__________________________________________________________________________________________________
