__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Pair_Input (InputLayer)         [(None, 44)]         0                                            
__________________________________________________________________________________________________
Encoder_Dense_1 (Dense)         (None, 256)          11520       Pair_Input[0][0]                 
__________________________________________________________________________________________________
Encoder_b_Dense_1 (Dense)       (None, 256)          11520       Pair_Input[0][0]                 
__________________________________________________________________________________________________
Encoder_Activation_1 (Activatio (None, 256)          0           Encoder_Dense_1[0][0]            
__________________________________________________________________________________________________
Encoder_b_Activation_1 (Activat (None, 256)          0           Encoder_b_Dense_1[0][0]          
__________________________________________________________________________________________________
Encoder_Input (InputLayer)      [(None, 53, 23)]     0                                            
__________________________________________________________________________________________________
Encoder_Dense_2 (Dense)         (None, 256)          65792       Encoder_Activation_1[0][0]       
__________________________________________________________________________________________________
Encoder_b_Dense_2 (Dense)       (None, 256)          65792       Encoder_b_Activation_1[0][0]     
__________________________________________________________________________________________________
Decoder_Dense_1 (Dense)         (None, 256)          11520       Pair_Input[0][0]                 
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 53, 256)      6144        Encoder_Input[0][0]              
__________________________________________________________________________________________________
Encoder_Activation_2 (Activatio (None, 256)          0           Encoder_Dense_2[0][0]            
__________________________________________________________________________________________________
Encoder_b_Activation_2 (Activat (None, 256)          0           Encoder_b_Dense_2[0][0]          
__________________________________________________________________________________________________
Decoder_Activation_1 (Activatio (None, 256)          0           Decoder_Dense_1[0][0]            
__________________________________________________________________________________________________
Decoder_Input (InputLayer)      [(None, None, 23)]   0                                            
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 53, 512)      1050624     time_distributed[0][0]           
                                                                 Encoder_Activation_2[0][0]       
                                                                 Encoder_Activation_2[0][0]       
                                                                 Encoder_b_Activation_2[0][0]     
                                                                 Encoder_b_Activation_2[0][0]     
__________________________________________________________________________________________________
Decoder_Dense_2 (Dense)         (None, 256)          65792       Decoder_Activation_1[0][0]       
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, None, 256)    6144        Decoder_Input[0][0]              
__________________________________________________________________________________________________
reshape (Reshape)               (None, 27136)        0           bidirectional[0][0]              
__________________________________________________________________________________________________
Decoder_Activation_2 (Activatio (None, 256)          0           Decoder_Dense_2[0][0]            
__________________________________________________________________________________________________
Decoder_Attention_VLSTM (RNN)   [(None, None, 1), (N 1246976     time_distributed_1[0][0]         
                                                                 reshape[0][0]                    
                                                                 Decoder_Activation_2[0][0]       
==================================================================================================
Total params: 2,541,824
Trainable params: 2,541,824
Non-trainable params: 0
__________________________________________________________________________________________________

